app/views/users/message.html.erb

SELECT `messages`.* FROM `messages` WHERE ((sender_id = 1 AND receiver_id = 1) OR (sender_id = 1 AND receiver_id = 1))
---
      <ul>
      <% @message.errors.full_messages.each do |msg| %>