app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE ((sender_id = 1 AND receiver_id = 1) OR (sender_id = 1 AND receiver_id = 1))
---
  def message
    # we save the user in this variable (we get the user ID from the URL (the route))
    @user = User.find(params[:id])

    # Then we write this query to get all the messages sent between user A and B,
    # or B and A depending on who sent the message
    @messages = Message.where("(sender_id = ? AND receiver_id = ?) OR (sender_id = ? AND receiver_id = ?)", current_user.id, @user.id, current_user.id, @user.id)

SELECT `users`.* FROM `users`
---
  def index
    if is_admin?
      @users = User.all

INSERT INTO `users` (`created_at`, `crypted_password`, `email`, `password_salt`, `persistence_token`, `updated_at`, `username`) VALUES ('2012-01-13 21:24:56', '8fc724536f76d80d76a74e7ca6d207f498ba15451d7af25fc5fcce76885e8eaffaa8d889ab6ef4cc26421f0cb8b4b6b33390dd037ab409b1d3023be00a2bec8b', 'pteroline@gmail.com', 'FxU4zR6cjIIc21rXPBO', '360be2ab48d545891a0c05533565140cdf98245d129c57025c32d8e987eab4a4c888093845e1ae8037d1f245ecb79b3d89f231c232e3eaa0e19551d6b6b3ef99', '2012-01-13 21:24:56', 'rose')
---
  def create
    if !current_user || is_admin?
      @user = User.new(params[:user])

      respond_to do |format|
        if @user.save