app/controllers/users_controller.rb

  def index
    if is_admin?
      @users = User.all

      @conversation = Conversation.find(1)
---
SELECT `conversations`.* FROM `conversations` WHERE `conversations`.`id` = 1 LIMIT 1